glocklueng/STM32F4xx_EMS/Utilities/SN8200/sn8200_api.c
    case SNIC_TCP_CLIENT_SOCKET_IND: {
        int8u listen_sock = buf[2];
        printf("Accepted connection from %i.%i.%i.%i\n\r", buf[4], buf[5], buf[6], buf[7]);
        printf("Connection socket: %d\n\r", buf[3]);

    }
    break;
    case SNIC_UDP_RECV_IND: {
        printf("%d %d\n\r", times++, htons(*((int16u*)&buf[9])));
    }
    break;
    case SNIC_UDP_SEND_FROM_SOCKET_RSP: {
        IsSNICUDPSendFromSocketResponsed = true;
        if (SNIC_SUCCESS != buf[2]) {
            printf("UDP Send bad\n\r");
        }
        sendUDPDone = 1;
        break;
    }

    case SNIC_HTTP_REQ|0x80:
    case SNIC_HTTPS_REQ|0x80:
    case SNIC_HTTP_MORE_REQ|0x80: {	
        char *contentT = "";
        unsigned short len = *((short*)&buf[4]);
        short contTLen = 0;
        unsigned short moreData = len & 0x8000;	
        char more[10] = {0};
        int8u seq = buf[1];
        short status = *((short*)&buf[2]);
                
        status = swap16(status);
        len = swap16(len);
        
        if (subCmdId == (SNIC_HTTP_MORE_REQ|0x80))
            strcpy(more, "more ");
        len &= 0x7fff;
        
        if (status >= 100) {
            contentT = (char*)&buf[6];;
            contTLen = strlen(contentT)+1;
        }
        
        if (status < 100) {
            printf("\nHTTP %sRSP code: %d, seq#: %d\n\r", more, status, seq);
            break;
        }

        printf("\nHTTP %sRSP code: %d, seq#: %d, Content Length: %d, Type: %s, More data: %s\n\r", more, status, seq, len, contentT, moreData?"yes":"no");
        isPrintable = 0;
        if (contTLen && (strstr(contentT, "text") || strstr(contentT, "xml") ||
            strstr(contentT, "javascript") || strstr(contentT, "html") ||
            strstr(contentT, "json"))) {
            isPrintable = 1;
            buf[6+contTLen+len] = 0;
            printf("Content: \n%s\n\r", buf+6+contTLen);
        }
    }
    break;
    case SNIC_HTTP_RSP_IND: {
                int8u seq = buf[1];
                unsigned short moreData;
                unsigned short len = *((short*)&buf[2]);
                len = swap16(len);
                moreData = len & 0x8000;
                len &= 0x7fff; 
                printf("\nHTTP RSP indication, seq#: %d, content length: %d, More data: %s\n\r", seq, len, moreData?"yes":"no");
                if (isPrintable) { 
                    buf[4+len] = 0;
                    printf("Content: \n%s\n\r", buf+4);
                }
	}
	break;

    default:
        break;

    }
    printf(".\n\r");
}

void SendSNIC(unsigned char *buf, int size)
{
    const unsigned int IP = udpDestIP;
    int16u port = udpDestPort;
    sendUDPDone = 0;
    udpSendFromSock(IP, port, mysock, 0, buf, size, seqNo++);
}


int fillNSendHttpReq(int8u seq, char* domain, char* uri, char method, char* contentType, char* otherHeader, int contentLen, char* content, unsigned char timeout, char moreData, char isHttps)
{
    char *ptr = NULL;
    int8u buf[1024];
    int16u encodedLen = moreData?contentLen|0x8000:contentLen;
    memset(buf, 0, sizeof(buf));
    buf[0] = SNIC_HTTP_REQ;
    buf[1] = seq;
    *((int16u*)&buf[2]) = 0x5000; //swapped
    buf[4] = method;
    buf[5] = timeout;
    
    if (isHttps) {
        buf[0] = SNIC_HTTPS_REQ;
        *((int16u*)&buf[2]) = 0xbb01; // 443 swapped 
    }

    ptr = (char*)buf+6;
    ptr += sprintf(ptr, "%s", domain)+1;
    ptr += sprintf(ptr, "%s", uri)+1;
    ptr += sprintf(ptr, "%s", contentType)+1;
    ptr += sprintf(ptr, "%s", otherHeader)+1;
    *((int16u*)ptr) = swap16(encodedLen);
    ptr += 2;
    if (contentLen) 
        memcpy(ptr, content, contentLen);

    serial_transmit(CMD_ID_SNIC, buf, ptr-(char*)buf+contentLen, ACK_NOT_REQUIRED);
    return 0;
}
/*add HttpMoreReq cmd*/
int fillNSendHttpMoreReq(int8u seq, int contentLen, char* content, char moreData)
{
    int8u buf[1024];
    int16u len = moreData?contentLen|0x8000:contentLen;
    buf[0] = SNIC_HTTP_MORE_REQ;
    buf[1] = seq;
    *((int16u*)&buf[2]) = swap16(len);

    if (contentLen+4 > sizeof(buf))
        return -1;

    memcpy(&buf[4], content, contentLen);
    serial_transmit(CMD_ID_SNIC, buf, contentLen+4, ACK_NOT_REQUIRED);
    return 0;
}

